app/views/users/show.html.erb

	      <tr>
		<td style="text-align: center;"><h2><%= @current_user.roles.where(:name => "owner", :resource_type => "Ground").count %> Campi posseduti:</h2></td>
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? AND (((roles.name = 'proprietor') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)))  [["user_id", 1]]
SELECT COUNT(*) FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? AND "roles"."name" = ? AND "roles"."resource_type" = ?  [["user_id", 1], ["name", "owner"], ["resource_type", "Ground"]]

		    </tr>
		    <% Ground.with_role(:owner, current_user).each do |ground| %>
---
SELECT "grounds".* FROM "grounds" INNER JOIN "roles" ON "roles".resource_type IN ('Ground') AND

	      <tr>
		<td><h2><%= @current_user.favorites.count %> Preferiti:</h2></td>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]