app/views/grounds/show.html.erb

	  <% @books.each do |book| %>
	  <% if Timetable.find(book.timetable_id).day == params[:dayChoice] %>
---
SELECT "timetables".* FROM "timetables" WHERE "timetables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	<tr class="border-top-row">
	  <td style="padding-top:20px; padding-left: 10px; padding-bottom:10px;"><b> <%= User.all.find(review.user_id).name %> </b></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]