app/controllers/books_controller.rb

  def create
    ground_id = params[:ground_id]
    user_id = current_user.id
    timetable_id = params[:timetable_id]
    b = Book.all.where(:ground_id => ground_id, :timetable_id => timetable_id).first
    b.user_id = user_id
    b.save!
---
SELECT "books".* FROM "books" WHERE "books"."ground_id" = ? AND "books"."timetable_id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["ground_id", 1], ["timetable_id", 1], ["LIMIT", 1]]
UPDATE "books" SET "user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["user_id", 2], ["updated_at", "2020-09-27 10:41:24.380053"], ["id", 1]]