app/controllers/books_controller.rb

SELECT "grounds".* FROM "grounds" WHERE "grounds"."id" = ? ORDER BY "grounds"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "timetables" ("day", "from", "to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day", "Lunedì"], ["from", 20], ["to", 21], ["created_at", "2020-10-30 10:05:36.704720"], ["updated_at", "2020-10-30 10:05:36.704720"]]
INSERT INTO "books" ("ground_id", "timetable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ground_id", 1], ["timetable_id", 1], ["created_at", "2020-10-30 10:05:36.710639"], ["updated_at", "2020-10-30 10:05:36.710639"]]
---
  def create
    @control_flag = false

    flash[:notice] = ""

    if (params[:from] == "") || (params[:to] == "")
      flash[:notice] += "• L'orario deve essere completo | "
      @control_flag = true
    end
    if (params[:from].to_i.to_s != params[:from]) || (params[:to].to_i.to_s != params[:to]) #Questo metodo serve per verificare che i prezzi siano numero ma non è molto bello a vedersi
      flash[:notice] += "• Gli orari devono essere numeri | "
      @control_flag = true
    elsif (params[:from].to_i > params[:to].to_i) || (params[:from].to_i < 0) || (params[:to].to_i > 24)
      flash[:notice] += "• Il formato dell'orario è sbagliato | "
      @control_flag = true
    end
    if @control_flag
      redirect_to new_ground_book_path(params[:ground_id])
    else

      if (current_user.has_role? :player)
        flash[:notice] = "Non hai il permesso di creare prenotazioni."
        redirect_to root_path
      else
        ground_id = params[:ground_id]
        @ground = Ground.find(ground_id)
        if (current_user.has_role? :owner, @ground) || (current_user.has_role? :admin)
          b = Book.new()
          g = Ground.all.where(:id => ground_id).first
          t = Timetable.create!(:day => params[:day], :from => params[:from], :to => params[:to])
          g.books << b