app/controllers/grounds_controller.rb

SELECT "grounds".* FROM "grounds" WHERE (title LIKE '%%') AND (price >= '%%') AND (price <= '%%') AND (time >= '%%') AND (time <= '%%')
---
  def index
    grounds = Ground.all

SELECT "grounds".* FROM "grounds" WHERE "grounds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."ground_id" IS NULL
---
  def show
    id = params[:id]
    @ground = Ground.find(id)

    @books = Book.all

    reviews = Review.all

INSERT INTO "grounds" ("title", "price", "city", "address", "description", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @control_flag = false
    flash[:notice] = ""
    if (params[:title] == "")
      flash[:notice] += "• Il campo nome non può essere vuoto | "
      @control_flag = true
    end
    if (params[:price1] == "") && (params[:price2] == "")
      flash[:notice] += "• Non possono essere vuoti tutti e due i campi del prezzo | "
      @control_flag = true
    end
    if (params[:price1].to_i.to_s != params[:price1]) || (params[:price2].to_i.to_s != params[:price2]) #Questo metodo serve per verificare che i prezzi siano numero ma non è molto bello a vedersi
      flash[:notice] += "• I prezzi devono essere numeri | "
      @control_flag = true
    end
    if (params[:city] == "")
      flash[:notice] += "• Il campo città non può essere vuoto | "
      @control_flag = true
    end
    if (params[:address] == "")
      flash[:notice] += "• Il campo indirizzo non può essere vuoto | "
      @control_flag = true
    end
    if @control_flag
      redirect_to new_ground_path
    else

      if (current_user.has_role? :proprietor) || (current_user.has_role? :admin) #Possono creare nuovi campo i proprietor e l'admin, non i player
        price = params[:price1].to_f + (params[:price2].to_f/100)
        @ground = Ground.create!(:title => params[:title], :price => price, :city => params[:city], :address => params[:address], :description => params[:description], :category => params[:category])

UPDATE "grounds" SET "updated_at" = ? WHERE "grounds"."id" = ?  [["updated_at", "2020-10-04 10:06:58.602387"], ["id", 1]]
---
        else
          @ground.ground_image.attach(io: File.open(Rails.root.join("app", "assets", "images", "default.jpg")), filename: 'default.jpg' , content_type: "image/jpg")
        end
        @ground.save!