app/controllers/reviews_controller.rb

SELECT "grounds".* FROM "grounds" WHERE "grounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comments", "user_id", "ground_id") VALUES (?, ?, ?, ?)  [["rating", 4], ["comments", "Ciao a tutti"], ["user_id", 1], ["ground_id", 1]]
UPDATE "grounds" SET "ratingNum" = ?, "ratingSum" = ?, "updated_at" = ? WHERE "grounds"."id" = ?  [["ratingNum", 1], ["ratingSum", 1], ["updated_at", "2020-10-04 15:01:30.604299"], ["id", 1]]
---
  def create
    ground_id = params[:ground_id]
    user_id = current_user.id
    @ground = Ground.find(ground_id)
    @review = Review.new(:rating => params[:rating], :comments => params[:review])
    @review.user_id = user_id
    @review.ground_id = ground_id
    @review.save!
    @ground.ratingNum = @ground.ratingNum + 1
    @ground.ratingSum = @ground.ratingSum + params[:rating].to_i
    @ground.save!

SELECT "grounds".* FROM "grounds" WHERE "grounds"."id" = ? LIMIT ?  [["id", 88], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
UPDATE "grounds" SET "ratingNum" = ?, "updated_at" = ? WHERE "grounds"."id" = ?  [["ratingNum", -1], ["updated_at", "2020-10-26 14:00:01.637997"], ["id", 94]]
---
  def destroy
    id = params[:id]
    id_ground = params[:ground_id]
    @ground = Ground.find(id_ground)
    @review = Review.find(id)
    @review.destroy
    @ground.ratingNum = @ground.ratingNum - 1
    @ground.ratingSum = @ground.ratingSum - @review.rating.to_i
    @ground.save!