app/controllers/session_controller.rb

SELECT "users"."id" FROM "users" WHERE "users"."name" = ?  [["name", "ss"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "michele"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "guest"]]
---
  def create
    name = params[:username]
    session[:user_id] = User.all.where(:name => params[:username]).ids.first
    @user = User.where(:name => name)
    if @user.length>0